It is used to split based on some criteria.

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame({'D1':np.random.randn(5),'D2':np.random.randn(5),'K1':list('xxyyz'),'K2':['Alpha','Beta','Alpha','Beta','Alpha']})

In [3]:
data

         D1        D2 K1     K2
0  0.057328 -0.227306  x  Alpha
1 -1.060112 -0.377478  x   Beta
2  0.660909  0.764940  y  Alpha
3 -1.461198 -1.106228  y   Beta
4  0.208639  0.412583  z  Alpha

#### Type 1 :-On the basis on two columns and same datasests.

In [4]:
data['D1'].groupby(data['K1']).mean()

K1
x   -0.501392
y   -0.400144
z    0.208639
Name: D1, dtype: float64

In [5]:
data['D1'].groupby(data['K1']).mean().count()

3

In [6]:
data['D1'].groupby(data['K1']).max()

K1
x    0.057328
y    0.660909
z    0.208639
Name: D1, dtype: float64

In [7]:
data['D1'].groupby(data['K1']).min()

K1
x   -1.060112
y   -1.461198
z    0.208639
Name: D1, dtype: float64

#### Type 2:-On the basis of array and Dataframe.

In [8]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [9]:
cities

array(['NY', 'LA', 'LA', 'NY', 'NY'], dtype='<U2')

In [10]:
month

array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'], dtype='<U3')

In [11]:
data['D2'].groupby([cities,month]).count()

LA  FEB    1
    JAN    1
NY  FEB    1
    JAN    2
Name: D2, dtype: int64

In [12]:
data['D2'].groupby([cities,month]).mean()

LA  FEB   -0.377478
    JAN    0.764940
NY  FEB   -1.106228
    JAN    0.092639
Name: D2, dtype: float64

In [13]:
data['D2'].groupby([cities,month]).sum()

LA  FEB   -0.377478
    JAN    0.764940
NY  FEB   -1.106228
    JAN    0.185277
Name: D2, dtype: float64

#### Type 4:-On the basis of two columns and full dataframe.

In [14]:
data.groupby(['K1','K2'])

In [15]:
data.groupby(['K1','K2']).count()

          D1  D2
K1 K2
x  Alpha   1   1
   Beta    1   1
y  Alpha   1   1
   Beta    1   1
z  Alpha   1   1

In [16]:
data.groupby(['K1','K2']).mean()

                D1        D2
K1 K2
x  Alpha  0.057328 -0.227306
   Beta  -1.060112 -0.377478
y  Alpha  0.660909  0.764940
   Beta  -1.461198 -1.106228
z  Alpha  0.208639  0.412583

#### Type 5:On the basis on dictionary to the columns of dataframe.

In [18]:
df1 = pd.DataFrame(np.arange(16).reshape(4,4),columns=['W','X','Y','Z'],index=['DOG','CAT','COW','LION'])

In [19]:
df1

       W   X   Y   Z
DOG    0   1   2   3
CAT    4   5   6   7
COW    8   9  10  11
LION  12  13  14  15

In [20]:
df1.iloc[1,0]=np.nan

In [21]:
df1

         W   X   Y   Z
DOG    0.0   1   2   3
CAT    NaN   5   6   7
COW    8.0   9  10  11
LION  12.0  13  14  15

In [22]:
dict1 = {'W':'Good','X':'BAD','Y':'GOOD','Z':'BAD'}

In [24]:
df1['W'][2]=np.nan

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [25]:
df1

         W   X   Y   Z
DOG    0.0   1   2   3
CAT    NaN   5   6   7
COW    NaN   9  10  11
LION  12.0  13  14  15